In [1]:
import numpy as np
import pandas as pd

In [5]:
nump = np.array([10,20,30,40,"Bala"])

In [6]:
type(nump)

numpy.ndarray

In [7]:
series = pd.Series(nump)

In [8]:
series

0      10
1      20
2      30
3      40
4    Bala
dtype: object

In [9]:
#DataFrame
convertlisttodataframe = [1,2,3,"bala"]

In [11]:
ltoD=pd.DataFrame(convertlisttodataframe)

In [12]:
type(ltoD)

pandas.core.frame.DataFrame

In [13]:
ltoD # DataFrame is having row level index and column level index it will start as "0"

      0
0     1
1     2
2     3
3  bala

In [14]:
#Series
info = np.array([10,20,30,"Bala"])

In [16]:
type(info)

numpy.ndarray

In [25]:
array_series = pd.Series(info)

In [26]:
type(array_series)

pandas.core.series.Series

In [27]:
array_series

0      10
1      20
2      30
3    Bala
dtype: object

In [29]:
#dict to series
dict = {'Name':'Bala', 'age':30,'place':'khammam'}

In [30]:
type(dict)

dict

In [49]:
dict_serice = pd.Series(dict)

In [50]:
type(dict_serice)

pandas.core.series.Series

In [51]:
dict_serice

Name        Bala
age           30
place    khammam
dtype: object

In [52]:
#Scalar: If we take the scalar values, then the index must be provided. The scalar value will be repeated for matching the length of the index.
x = pd.Series("Bala", index=[0,1])

pandas.core.series.Series

In [54]:
x

0    Bala
1    Bala
dtype: object

In [64]:
x = pd.Series([1,2,3,5,10],index=['a','b','c','d','e'])

In [65]:
x

a     1
b     2
c     3
d     5
e    10
dtype: int64

In [66]:
x[0]

1

In [67]:
#Series.index-Defines the index of the Series.
x.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [68]:
#Series.shape It returns a tuple of shape of the data.
x.shape

(5,)

In [69]:
#Series.dtype - It returns the data type of the data.
x.dtype

dtype('int64')

In [70]:
#Series.size - It returns the size of the data.
x.size

5

In [71]:
#Series.empty- It returns True if Series object is empty, otherwise returns false.
x.empty

False

In [72]:
xb = pd.Series([])

In [73]:
xb.empty

True

In [74]:
#Series.hasnans- It returns True if there are any NaN values, otherwise returns false.
xb.hasnans

False

In [82]:
xb1 = pd.Series([1,1,'NaN'])

In [83]:
xb1

0      1
1      1
2    NaN
dtype: object

In [84]:
xb1.hasnans

False

In [85]:
#Series.nbytes- It returns the number of bytes in the data.
xb1.nbytes

24

In [86]:
#Series.ndim - It returns the number of dimensions in the data.
xb1.ndim

1

In [92]:
#Series.itemsize- It returns the size of the datatype of item.
xb1.itemsize

C:\Users\Balakrishna_Vema\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Series.itemsize is deprecated and will be removed in a future version

8

In [94]:
xb1

0      1
1      1
2    NaN
dtype: object

In [95]:
x_NaN = pd.Series([1,3,np.NaN])

In [97]:
x_NaN.hasnans

True

In [101]:
data_t = x_NaN.to_frame

In [102]:
type(data)

method

In [104]:
#Pandas Series.map()- Map the values from two series that have a common column.
x.map(x_NaN)

a    3.0
b    NaN
c    NaN
d    NaN
e    NaN
dtype: float64

In [105]:
x

a     1
b     2
c     3
d     5
e    10
dtype: int64

In [106]:
x_NaN

0    1.0
1    3.0
2    NaN
dtype: float64

In [118]:
#Pandas Series.std()- Calculate the standard deviation of the given set of numbers, DataFrame, column, and rows.
x1 = pd.Series([1,2,3,4,5,])
x1.std()

1.5811388300841898

In [119]:
#Pandas Series.to_frame(): Convert the series object to the dataframe.
x1.to_frame()

   0
0  1
1  2
2  3
3  4
4  5

In [135]:
#Pandas Series.value_counts():	Returns a Series that contain counts of unique values.
X_un = pd.Series([1,2,2,10]).sort_values(ascending=False)

In [137]:
X_un.value_counts()

2     2
10    1
1     1
dtype: int64

In [2]:
list = [1,2,3,4,5]
list

[1, 2, 3, 4, 5]

In [3]:
type(list)

list

In [4]:
import pandas as pd
import numpy as np

In [5]:
series = pd.Series(list)

In [6]:
type(series)

pandas.core.series.Series

In [10]:
#conver series to datafram 
dataframe= series.to_frame()

In [11]:
type(dataframe)

pandas.core.frame.DataFrame

In [12]:
#another way to conver series to dataframe
Data_frame = pd.DataFrame(series)

In [14]:
type(dataframe)

pandas.core.frame.DataFrame

# Pandas functions

In [17]:
# 1- A for Append 2- A for apply , 3- A for Aggregation, 4- A for Assign, 5 A for Astype
#1-A fo appened- appened is the add the rowns into exiting table
#exp:
Datafram = pd.DataFrame({'RollNO':[1,2,3,4,5], 'Names': ['Jaishu','Balu','Rajitha','Amma','Kondal']})

In [18]:
type(Datafram)

pandas.core.frame.DataFrame

In [19]:
Datafram

   RollNO    Names
0       1   Jaishu
1       2     Balu
2       3  Rajitha
3       4     Amma
4       5   Kondal

In [20]:
import pandas as pd

In [34]:
Datafram1 = pd.DataFrame({'Roll': [6,7],'Names':['sindu','ramya']})

In [35]:
type(Datafram1)

pandas.core.frame.DataFrame

In [26]:
series = pd.Series(Datafram.Names)

In [31]:
type(series)

pandas.core.series.Series

In [36]:
series1 = pd.Series(Datafram1.Names)

In [37]:
append = series.append(series1)

In [40]:
append.reset_index()

   index    Names
0      0   Jaishu
1      1     Balu
2      2  Rajitha
3      3     Amma
4      4   Kondal
5      0    sindu
6      1    ramya

In [41]:
append1 = Datafram.append(Datafram1, ignore_index=True)

C:\Users\Balakrishna_Vema\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

In [42]:
append1

     Names  Roll  RollNO
0   Jaishu   NaN     1.0
1     Balu   NaN     2.0
2  Rajitha   NaN     3.0
3     Amma   NaN     4.0
4   Kondal   NaN     5.0
5    sindu   6.0     NaN
6    ramya   7.0     NaN

In [45]:
#2.apply function- we can pass the function inside in apply
append1.apply(np.count_nonzero)

Names     7
Roll      7
RollNO    7
dtype: int64

In [60]:
#3. aggregation: we can do some aggrregation in function like sum, min, max
append1.agg({'RollNO':'sum'})

RollNO    15.0
dtype: float64

In [61]:
#assign - we can assign the new column into the existing table 
city = pd.DataFrame({'city':['hyd','bang','kmm','kmm','kmm','bng','kmm']})

In [64]:
assign_new_coulm = append1.assign(col = city)

In [65]:
assign_new_coulm

     Names  Roll  RollNO   col
0   Jaishu   NaN     1.0   hyd
1     Balu   NaN     2.0  bang
2  Rajitha   NaN     3.0   kmm
3     Amma   NaN     4.0   kmm
4   Kondal   NaN     5.0   kmm
5    sindu   6.0     NaN   bng
6    ramya   7.0     NaN   kmm

In [67]:
assign_new_coulm.dtypes

Names      object
Roll      float64
RollNO    float64
col        object
dtype: object

In [74]:
a = {'col':[1,2],'col2':[3,4]}

In [75]:
info = pd.DataFrame(data=a)

In [76]:
info.dtypes

col     int64
col2    int64
dtype: object

In [84]:
assign_new_coulm

     Names  Roll  RollNO   col
0   Jaishu   NaN     1.0   hyd
1     Balu   NaN     2.0  bang
2  Rajitha   NaN     3.0   kmm
3     Amma   NaN     4.0   kmm
4   Kondal   NaN     5.0   kmm
5    sindu   6.0     NaN   bng
6    ramya   7.0     NaN   kmm

In [86]:
#count:it will count the each column non-NA values 
assign_new_coulm.count().nonzero

<bound method Series.nonzero of Names     7
Roll      2
RollNO    5
col       7
dtype: int64>

In [88]:
#Describe- calculate some statistical data like %, mean & std
assign_new_coulm.describe().T

        count  mean       std  min   25%  50%   75%  max
Roll      2.0   6.5  0.707107  6.0  6.25  6.5  6.75  7.0
RollNO    5.0   3.0  1.581139  1.0  2.00  3.0  4.00  5.0

In [95]:
#Drop.duplicates - to drop the duplicated in row level 
append1 = assign_new_coulm.append({'Names':'ramya','Roll':7,'col':'kmm'},ignore_index=True)

In [96]:
append1

     Names  Roll  RollNO   col
0   Jaishu   NaN     1.0   hyd
1     Balu   NaN     2.0  bang
2  Rajitha   NaN     3.0   kmm
3     Amma   NaN     4.0   kmm
4   Kondal   NaN     5.0   kmm
5    sindu   6.0     NaN   bng
6    ramya   7.0     NaN   kmm
7    ramya   7.0     NaN   kmm

In [97]:
#Remove duplicate values-drop.duplicate()
append1.drop_duplicates(keep='last')

     Names  Roll  RollNO   col
0   Jaishu   NaN     1.0   hyd
1     Balu   NaN     2.0  bang
2  Rajitha   NaN     3.0   kmm
3     Amma   NaN     4.0   kmm
4   Kondal   NaN     5.0   kmm
5    sindu   6.0     NaN   bng
7    ramya   7.0     NaN   kmm

In [119]:
#Pandas DataFrame.groupby()
data = {'Name':['bala','jai','raj','kri'],'age':[22,22,23,25],'course':['b.sc','d.com','b.ed','ba']}
datafram = pd.DataFrame(data)

In [120]:
datafram.dtypes

Name      object
age        int64
course    object
dtype: object

In [129]:
group = datafram.groupby('age',axis=1)

In [130]:
print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002154C83BE88>

In [135]:
#head 
datafram.head(2)

   Name  age course
0  bala   22   b.sc
1   jai   22  d.com

In [137]:
#Pandas : joins= we can join two tables 
datafram

   Name  age course
0  bala   22   b.sc
1   jai   22  d.com
2   raj   23   b.ed
3   kri   25     ba

In [142]:
Datafram

   RollNO    Names
0       1   Jaishu
1       2     Balu
2       3  Rajitha
3       4     Amma
4       5   Kondal

In [145]:
data = {'number':[1,2,3,4,5],'names':['bala','rajitha','jai','amma','sindu']}
data1 = {'number':[2,3],'age':[20,30]}

In [146]:
data = pd.DataFrame(data)
data1 = pd.DataFrame(data1)

In [159]:
data.join(data.set_axis=['number'],on='number')

SyntaxError: keyword can't be an expression (<ipython-input-159-1e06f3872e05>, line 1)

In [174]:
#Rename- we chan rename the columns 
renane = data.rename(columns={'names':'Id'},inplace=False)

In [175]:
renane

   number       Id
0       1     bala
1       2  rajitha
2       3      jai
3       4     amma
4       5    sindu